{"keras_version": "2.2.4", "config": {"layers": [{"name": "input_1", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 128, 128, 1]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_1", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 32, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_2", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 32, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_1", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 64, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_4", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 64, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_2", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_5", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 128, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_6", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 128, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_3", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_7", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 256, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_8", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 256, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_8", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_4", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_9", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 512, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_9", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_10", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 512, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_10", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_1", "config": {"kernel_size": [2, 2], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "bias_regularizer": null, "activation": "linear", "output_padding": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "filters": 256, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_transpose_1", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": 3}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_11", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 256, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_11", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_12", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 256, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_12", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_2", "config": {"kernel_size": [2, 2], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "bias_regularizer": null, "activation": "linear", "output_padding": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "filters": 128, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_transpose_2", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "axis": 3}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_13", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 128, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_13", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_14", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 128, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_14", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_3", "config": {"kernel_size": [2, 2], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "bias_regularizer": null, "activation": "linear", "output_padding": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_transpose_3", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "concatenate_3", "config": {"trainable": true, "name": "concatenate_3", "axis": 3}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_15", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 64, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_15", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_16", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 64, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_16", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_4", "config": {"kernel_size": [2, 2], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "bias_regularizer": null, "activation": "linear", "output_padding": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_transpose_4", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "concatenate_4", "config": {"trainable": true, "name": "concatenate_4", "axis": 3}, "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_17", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 32, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_17", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_18", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 32, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_18", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_19", "config": {"kernel_size": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "filters": 1, "activation": "sigmoid", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_19", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "Conv2D"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv2d_19", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}